<a href="https://colab.research.google.com/github/Pritam-Mondal18/Machine-Learning-yt/blob/main/Pandas_phase1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
## Use case of pandas
### 1. Data Cleaning
### 2. Data Analysis
### 3. Data Transformation
### 4. Data Visualization (Basic Level)
### 5. Data Aggregation
### 6. File Handling
### 7. Data Filtering & Selection
### 8. Time Series Analysis

# Pandas Series

A series is a one-dimantional labeled array capable of holding any data type.The axis labels are collectivly called the index.

## Creating Series
### There are multiple ways to create a pandas series:

In [9]:
import numpy as np
import pandas as pd

In [15]:
labels = ['a','b','c'] # labels are nothing but index
my_list = [10,20,30]
arr = np.array([10,20,30,40])
d = {1:20, 2:30, 3:40}

In [13]:
# Series using list
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [14]:
# change the series index/labels
pd.Series(my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [20]:
# Create Series using Array
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int64

In [21]:
# create Series using Dictinary
# We use by default index which are maintioned in the dictinaty
pd.Series(d)

1    20
2    30
3    40
dtype: int64